Revit 2024 API
CanExecuteEventArgs.CanExecute Property
The value that indicates whether the Command associated with this event can be executed.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanExecute { get; set; }
Visual Basic
Public Property CanExecute As Boolean
	Get
	Set
Visual C++
public:
property bool CanExecute {
	bool get ();
	void set (bool value);
}
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace